Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་ངས་ལྟ་བའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དེ་བཞིན་དུ་སྦྱར་ཏེ། བདག་གིས་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of the defilement of views. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the origin as related to knowledge of the defilement of views.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་ཤེས་རབ་རྙོག་པ་མེད་པ་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Unblemished Insight.

source: རྫུ་འཕྲུལ་ཆེ་བ། མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་པ་རྣམས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་ངོ་། །
en: This sage possessed tremendous miraculous powers and splendor and had attained freedom from attachment to pleasures by means of the outer path.

source: གང་ཞིག་ཡོད་ན་ལྟ་བར་གྱུར་པ་ཡང་དག་པར་འབྱུང་བར་འགྱུར།
en: ‘What makes views emerge?

source: གང་ཞིག་མེད་ན་ལྟ་བར་གྱུར་པ་རྣམས་སྤོང་བར་འགྱུར།
en: And what causes one to give them up?

source: མུན་པའི་ཚོགས་གསུམ་ཡོད་ན། ལྟ་བར་གྱུར་པ་རྣམས་ཀུན་འབྱུང་བར་འགྱུར་ལ། དེ་དག་ཉིད་མེད་ན་ལྟ་བར་གྱུར་པ་དག་མི་འབྱུང་ངོ་། །
en: Views arise when three gatherings of darkness are present, and not when those three are absent.

source: མུན་པའི་ཚོགས་གསུམ་གང་ཞེ་ན།
en: What are the three gatherings of darkness?

source: འདས་པའི་དུས་སུ་བདག་བྱུང་ངམ་མ་བྱུང་།
en: (1) “Was there a self in the past or not?

source: ཅི་འདས་པའི་དུས་སུ་བྱུང་ནས་བྱུང་བར་གྱུར་ཏམ།
en: Is the self something that came from the past?”

source: བདག་མ་འོངས་པའི་དུས་སུ་འབྱུང་བར་འགྱུར་རམ་མི་འགྱུར།
en: (2) “Will the self be there in the future or not?

source: ཅི་མ་འོངས་པའི་དུས་སུ་བྱུང་ནས་འབྱུང་བར་འགྱུར་རམ།
en: Will it be there and continue in the future?”

source: ད་ལྟར་གྱི་དུས་འདི་ལ་ཡང་སོམ་ཉི་དང་ཐེ་ཙོམ་དུ་འགྱུར་ཏེ།
en: (3) Likewise, one may also wonder and have doubts about the present, thinking,

source: བདག་ཅི་ཡིན་བདག་ཇི་ལྟ་བུ་ཞིག་ཅི་བདག་བྱུང་བར་གྱུར་ཏམ། ཇི་ལྟར་བྱུང་བར་གྱུར་སེམས་ཅན་དེ་དག་གར་སོང་།
en: “What is the self? What sort of thing is it? How and in what way is it here? Where have sentient beings gone?

source: དེ་འདི་ནས་ཤི་ནས་གར་འགྲོ་བར་འགྱུར་སྙམ་མོ། །
en: Once they have died here, where do they go?”

source: དེ་བདག་ཡོད་དོ་ཞེས་དེའི་ངེས་པར་འགྱུར་ཏེ། དེ་རྟག་པར་མངོན་པར་ཞེན་པར་འགྱུར་རོ། །
en: “ ‘Thus, one may feel certain that there is a self and become attached to that self as being permanent.

source: དེ་སྔོན་གྱི་མཐར་རྟོག་པ་རྟག་པར་ལྟ་བ་བཞི་འཐོབ་སྟེ། གཅིག་ཏུ་རྟག་པར་ལྟ་བ་བཞི་འཐོབ་བོ། །
en: In this way, one may acquire four views of permanence that are based on the past and so one obtains the four views that are strictly considering permanence.

source: མཐར་ལྟ་ཞིང་སྨྲ་བ་བཞི་འཐོབ་འདུ་ཤེས་སུ་ལྟ་ཞིང་སྨྲ་བ་བཅུ་དྲུག་འཐོབ། འདུ་ཤེས་སུ་ལྟ་བ་བརྒྱད་འཐོབ། འདུ་ཤེས་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་པ་བརྒྱད་འཐོབ། མཐོང་བའི་ཆོས་ལ་མྱ་ངན་ལས་འདས་པར་ལྟ་བ་ལྔ་འཐོབ་ཆད་པར་ལྟ་བ་བདུན་འཐོབ་སྟེ།
en: Likewise, one may acquire the four views and positions that are extreme, the sixteen views and positions related to notions, the eight views related to notions, the eight views on neither presence nor absence of notions, the five views on deliverance in the present life, or the seven annihilationist views.

source: ངེས་པ་ཡོད་པར་མི་འགྱུར་རོ། །
en: About this, there is no certainty.

source: དེ་རྒྱུ་མེད་པའི་ལྟ་བ་གཉིས་འཐོབ་སྟེ། ངེས་པ་ཡོད་པར་མི་འགྱུར་རོ། །
en: Moreover, one may acquire the two views of no cause, also without any certainty.

source: ངག་འཁྲུལ་པའི་ལྟ་བ་བཞི་འཐོབ་སྟེ། བདག་ཡོད་དོ་ཞེས་ངེས་པར་མི་འགྱུར་རོ། །
en: One may also acquire the four views associated with confused speech without certainty as to whether the self exists.

source: དེ་མཐོང་བའི་ཆོས་ལ་མྱ་ངན་ལས་འདས་པ་ལྔ་འདོགས་པར་བྱེད་པ་ཆད་པར་ལྟ་བ་བཞི་འཐོབ་སྟེ།
en: The five ideas about deliverance in the present life bring four views of annihilation.

source: དེ་དག་ཐམས་ཅད་ཆད་པ་དང་། རྟག་པའི་ཕྱོགས་གཉིས་ལ་གནས་ཏེ། གང་ཟག་གཉིས་པོ་དེ་དག་སྙོམས་པར་ཞུགས་སོ། །
en: In any case, all of these positions are either views of permanence or annihilation and so they are adopted by two types of person.

source: རྟོག་གེ་པ་ཁ་ཅིག་དག་བདག་རྒྱུ་མེད་པ་ལས་བྱུང་བར་མཐོང་སྟེ། སྙོམས་པར་ཞུགས་པའི་དབང་གིས་སེམས་རྩེ་གཅིག་པ་ཐོབ་ཀྱང་འཆི་བ་མི་དྲན་ནོ། །
en: “ ‘Certain logicians perceive the self to be an uncaused occurrence, because although they attain one-pointed mind by the power of equipoise they do not recollect death.

source: གང་རྟོག་གེ་པ་དེ་དག་བརྟགས་ནས་རྣམ་པར་བརྗོད་དེ་འདི་སྐད་སྨྲའོ། །
en: Such logicians may then reason as follows:

source: རྒྱུ་མེད་པ་ལས་བྱུང་སྟེ། དེ་རྒྱུ་མེད་པས་མི་འགོག་གོ་ཞེས་རྟག་པ་དང་། ཆད་པ་དང་མཐའ་མེད་པར་འགྲོ་བ་མཐོང་ངོ་། །
en: “The self arises uncaused, and since it has no cause it cannot disintegrate.” Thus they perceive beings to be beyond permanence, annihilation, and limitations.

source: གང་གིས་སེམས་ཅན་ཀུན་འབྱུང་བའི་རིགས་པ་གཞན་གང་དག་ཡོད་དམ་ཞེས་མཐའ་གཉིས་པོ་འདི་ལ་བརྟེན་ནས་བློ་རྣམ་པར་དཔྱོད་དོ། །
en: Then, wondering whether there might be other ways to reason about the origin of sentient beings, they inquire based on the two extremes.’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱས་པས་ཤེས་རབ་ཀྱི་མིག་སྐྱེས་ནས།
en: “By correctly thinking in this way, the sage developed the eye of insight and so he understood:

source: འདི་ལ་སེམས་ཅན་མེད་ཅིང་ཉོན་མོངས་པ་དག་ལས་ལས། ལས་དག་ལས་རྣམ་པར་སྨིན་པ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་ཏེ། དེ་ལས་ཀྱང་རྣམ་པར་ཤེས་པའོ། །
en: ‘While there are no sentient beings, the afflictions become the basis for karmic actions, and as karmic actions ripen, consciousness emerges.

source: མ་རིག་པ་དང་སྲེད་པ་ནི་ཉོན་མོངས་པ། འདུ་བྱེད་དང་སྲིད་པ་ནི་ཞིང་། ཉེ་བར་ལེན་པ་ནི་སེར། མྱུ་གུ་ནི་སྐྱེ་བ་སྟེ། དེ་ལ་སྡུག་བསྔལ་དང་། རྒ་ཤི་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་ཞིང་
en: Ignorance and craving are afflictions, formation and becoming are the field, grasping is moisture, birth is the sprout, and from that grow suffering, aging and death, pain, lamentation, and distress.

source: དེ་བཞིན་དུ་སྡུག་བསྔལ་གྱི་ཤིང་འདི་འབྱུང་བར་འགྱུར་རོ། །
en: Thus this field of suffering emerges.

source: དེ་བཞིན་དུ་སྔོན་མ་ཐོས་པའི་ཆོས་འདི་རྣམས་ལ་རྐྱེན་ལས་མ་གཏོགས་པ་འདིར་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པ་མེད་དོ། །
en: Likewise, according to this Dharma, which has not been heard before, no phenomenon arises or ceases without being created by conditions.

source: འདི་ལྟ་སྟེ་འདི་ཡོད་པས་འདི་འབྱུང་། འདི་སྐྱེས་པའི་ཕྱིར་འདི་སྐྱེ་སྟེ།
en: Thus, when this is present, that comes to be, and when this arises, that will occur.

source: འདི་ལྟ་སྟེ་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ། རྣམ་པར་ཤེས་པའི་རྐྱེན་ནས་རྒ་ཤིའི་བར་དུ་སྟེ།
en: The condition of ignorance brings karmic formation, and by that condition there will be consciousness, which in turn brings everything else up to aging and death.

source: དེ་བཞིན་དུ་སྡུག་བསྔལ་གྱི་ཕུང་པོ་འདི་འབའ་ཞིག་པོ་འབྱུང་བར་འགྱུར་ཞིང་།
en: Thus arises this great mass of nothing but suffering.

source: བདག་སེམས་པར་མི་བྱེད། གཞན་སེམས་པར་མི་བྱེད་དོ། །
en: It is not intended by oneself and not intended by anyone else.

source: དེ་འདིའི་རྐྱེན་གཞན་ལས་ཇི་ལྟར་འགྱུར།
en: How could all this arise due to other conditions?

source: དེ་བཞིན་དུ་རྒ་ཤིའི་བར་ཡོངས་སུ་ཤེས་པར་བྱེད་དོ། །
en: This understanding is to be applied to everything up to and including aging and death.

source: ཀྱེ་མ་འཇིག་རྟེན་གནས་པ་འདི་ནི་འཁྲུལ་པའོ་སྙམ་ནས།
en: Ah, the state of the world is delusion!’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་དབུས་སུ་འདུག་ནས་ཆོས་འདི་སྟོན་པར་བྱེད་དོ། །
en: “Arising from his absorption, the sage went on to teach this Dharma amid a gathering of many hundreds of thousands.

source: གྲོགས་པོ་དག་འདི་ལ་སེམས་ཅན་གང་སྐྱེ་བའམ། འགག་པ་གང་ཡང་མེད་དེ།
en: ‘Friends,’ he explained, ‘there are no sentient beings who are born or die.

source: ཁྱེད་ཅག་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་སོ་སོར་རྟོགས་ཤིང་།
en: You must realize the essential nature of phenomena exactly as it is.

source: ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དོ། །
en: The essential nature of phenomena is precisely the absence of an essential nature.’

source: དེ་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་རབ་ཏུ་སྟོན་པ་ན་སྲོག་ཆགས་ཁྲག་ཁྲིག་གྲངས་མེད་པ་དག་གིས་འདི་ལ་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པ་མེད་པར་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་རྣམ་པར་ཤེས་ཤིང་དེ་དག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: When Unblemished Insight taught the essential nature of phenomena in this way, innumerably many billions of beings understood that no phenomena arise or cease. Comprehending that this is the essential nature of phenomena, they gained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤེས་རབ་རྙོག་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Unblemished Insight was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤེས་རབ་རྙོག་པ་མེད་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Unblemished Insight.

source: ངས་སྲོག་ཆགས་ཁྲག་ཁྲིག་གྲངས་མེད་པ་དེ་དག་ངོ་བོ་ཉིད་མེད་པ་ལ་རབ་ཏུ་བཙུད་དོ། །
en: I established innumerable billions of beings within the absence of essential nature.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྟ་བ་རྙོག་པ་མེད་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas must achieve a view that is unblemished.

source: ངོ་བོ་ཉིད་མེད་པའི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱ། སོ་སོར་རིག་པར་བྱའོ། །
en: They must fully comprehend and realize the essential nature of all phenomena that are without essential nature.

source: ངོ་བོ་ཉིད་མེད་པའི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: Bodhisattvas who accurately comprehend the essential nature of all phenomena that are without essential nature will quickly become irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་ངས་ལྟ་བའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། མངོན་པར་འདུས་བྱས་པའི་བར་དང་བདག་གིས་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་པའི་བར་དུའོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand cessation as related to knowledge of the defilement of views. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of cessation as related to knowledge of the defilement of views.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་ཤེས་རབ་མཁས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage known as Skillful Insight.

source: རྫུ་འཕྲུལ་ཆེ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། འདོད་ཆགས་དང་བྲལ་བའི་བར་ཞིག་བྱུང་ངོ་། །
en: He possessed great miraculous powers and abilities, and had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་དབེན་པར་སོང་སྟེ། ནང་དུ་ཡང་དག་བཞག་པ་དང་། སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་བསྐྱེད་དེ།
en: This sage went into solitude and when thus practicing meditation he came to think,

source: ཀྱེ་མ་འཇིག་རྟེན་འདི་ནི་ཉོན་མོངས་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ་སྡུག་བསྔལ་ལས་ངེས་པར་འབྱུང་བ་རབ་ཏུ་མི་ཤེས་སོ་སྙམ་མོ། །
en: ‘Alas, this world is afflicted, and yet we do not know how to achieve deliverance from suffering.’

source: སྡུག་བསྔལ་ལས་ངེས་པར་འབྱུང་བ་གང་ཡིན།
en: ‘What is deliverance from suffering?

source: རྟོག་པ་ལས་སྡུག་བསྔལ་འབྱུང་ཞིང་ཡོངས་སུ་རྟོག་པ་མེད་ན་མི་འབྱུང་ངོ་སྙམ་མོ། །
en: Suffering comes from concepts. Without concepts there will be no suffering.’

source: དེ་དེ་ལྟར་རིག་ནས་གང་གི་ཚེ་འདུ་བྱེད་ཐམས་ཅད་ཞི་ཞིང་སྲེད་པ་ཟད།
en: As he gained this insight, his karmic formations were pacified and he brought craving to exhaustion.

source: འདོད་ཆགས་མ་ལུས་པ་དང་བྲལ་ཞིང་འགོག་པ་མྱ་ངན་ལས་འདས་པ་འདི་ནི་ཞི་བའོ། །
en: He became entirely free of desire and realized that the cessation of nirvāṇa is peace.

source: འདི་ནི་གྱ་ནོམ་པའོ་སྙམ་མོ། །
en: “ ‘This,’ he thought, ‘is sublime.

source: མྱ་ངན་ལས་མ་འདས་པའི་སེམས་ཅན་གང་ཁ་ཅིག་མྱ་ངན་ལས་འདས་པ་ཡོད་དམ་སྙམ་མོ། །
en: Now, is there any sentient being who has gone beyond suffering?’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ན་འདུ་ཤེས་འདི་ལྟ་བུ་སྐྱེས་སོ། །
en: And while pondering this question correctly, he gained the following understanding:

source: གལ་ཏེ་གང་སེམས་ཅན་ཞིག་ཡོད་ན་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་ཞིག་ན།
en: ‘If there were any sentient beings, there could also be a transcendence of suffering.

source: སེམས་ཅན་མེད་པས་མྱ་ངན་ལས་འདས་པ་ནི་མེད་དོ། །
en: But since there are no beings, there is also no transcendence of suffering.

source: སེམས་ཅན་གྱི་འདུ་ཤེས་རང་ལས་བྱུང་བའི་སྡུག་བསྔལ་གྱིས་གནོད་དེ།
en: Thus we harm ourselves by having notions of sentient beings.

source: འགྲོ་བ་དག་མྱ་ངན་ལས་འདས་པ་ཚོལ་བ་ནི་མྱ་ངན་ལས་འདས་པ་གཞན་མ་ཡིན་ཞིང་ཕུང་པོ་གཞན་མ་ཡིན་ཏེ།
en: When beings search for nirvāṇa, that is nothing but nirvāṇa, and nothing but the aggregates.

source: ཕུང་པོ་ཉིད་མྱ་ངན་ལས་འདས་པའོ། །
en: The aggregates themselves are nirvāṇa.

source: སེམས་ཅན་གྱི་དམིགས་པ་ནི་མྱ་ངན་ལས་འདས་པ་ཡིན་ནོ་སྙམ་མོ། །
en: Because the apprehensions of beings are nirvāṇa.’

source: དེ་དྲན་པ་ཉེ་བར་གཞག་པར་ཤེས་ནས་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། སྒྲ་ཕྱུང་ཞིང་སྒྲ་དབྱངས་རྗེས་སུ་སྒྲོགས་པ།
en: “Being mindful of this understanding, he arose from his absorption and proclaimed:

source: རང་གི་ཀུན་ཏུ་རྟོག་པ་ནི། །སྡུག་བསྔལ་ཕུང་པོ་རབ་ཏུ་འཇུག །
en: “ ‘Our own thoughts Uphold the aggregates of suffering.

source: ཀུན་ཏུ་རྟོག་པ་མེད་པ་ནི། །སྡུག་བསྔལ་ཕུང་པོ་འགག་པར་འགྱུར། །
en: Without thinking, There are no aggregates of suffering.

source: སེམས་ཅན་གང་ཡང་སྐྱེ་བ་མེད། །
en: “ ‘No sentient being was ever born

source: ཆོས་ནི་གང་ཡང་འགག་པ་མེད། །
en: And no phenomenon ever ceased.

source: ཆོས་ལས་རྣམ་པར་རྟོག་གཞན་མེད། །
en: When there are no thoughts apart from the Dharma,

source: དེ་ནི་མྱ་ངན་འདས་ཞེས་བྱ། །
en: Then that is transcendence of suffering.’

source: དེའི་སྒྲ་དབྱངས་དེ་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: “As they heard the sage’s voice, innumerably many tens of thousands of beings gained acceptance that phenomena are unborn and so they became irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། དྲང་སྲོང་ཤེས་རབ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Skillful Insight was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཤེས་རབ་མཁས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Skillful Insight.

source: དེའི་སྒྲ་དབྱངས་དེ་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་གིས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As they heard my voice, innumerably many tens of thousands of beings attained acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཤེས་རབ་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood must develop skillful insight.

source: མཽད་གལ་གྱི་བུ་ངས་ལྟ་བའི་ཟག་པ་ཟད་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the path that leads to cessation as related to knowledge of the defilement of views. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of the defilement of views.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་གྲགས་འཕགས་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Noble Fame .

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་བ་ཞེས་བྱ་བ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། འདོད་ཆགས་དང་བྲལ་བའི་བར་ཞིག་བྱུང་ངོ་། །
en: He possessed great miraculous powers and abilities, and had attained freedom from attachment to pleasures by means of the outer path.

source: དེ་བྲམ་ཟེའི་ཁྱེའུ་བདུན་སྟོང་དང་། འབྱུང་བ་ཆེན་པོ་བཞི་འབྱུང་བ་ཐ་མི་དད་པ་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་གནས་པའི་གསང་ཚིག་འདོན་ཏོ། །
en: “At the time there was a group of seven thousand brahmin boys who were engaged in reciting the spells for the simultaneity and sameness of the four elements.

source: དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་གི་འཁོར་ན།
en: Within that group was a boy known as Supreme Intelligence.

source: བྲམ་ཟེའི་ཁྱེའུ་མཆོག་གི་བློ་གྲོས་ཞེས་བྱ་བ་བྲམ་ཟེའི་ཁྱེའུའི་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་གཙོ་བོ་བྱེད་པ། གང་བྲམ་ཟེའི་ཁྱེའུ་བདུན་སྟོང་པོ་དེ་དག་གིས་གསང་ཚིག་གཟུང་བ་དེ་གཅིག་པུས་དྲན་ཞིང་དེ་ཡུན་མི་རིང་བར་རིག་བྱེད་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྱུར་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He was the leader of all the brahmin boys, the only one of them who was able to recollect all their spells, and before long he had mastered all of the Vedas. This boy thought to himself,

source: དོན་གང་མི་ཤེས་པའི་གསང་ཚིག་འཛིན་པ་དོན་མེད་པ་འདིས་ཅི་ཞིག་བྱ།
en: ‘What is the point of remembering so many spells without knowing anything about their meaning?

source: གང་བདག་གིས་རིག་བྱེད་དང་གསང་ཚིག་འདིའི་དོན་བཙལ་བར་བྱའོ་སྙམ་ནས།
en: I must find out what the Vedas and the spells mean.’

source: དེ་དེའི་ཚེ་དགོན་པ་བས་མཐའི་གནས་མལ་དུ་འདུག་སྟེ། དེ་དབེན་པར་སོང་ནས་ནང་དུ་ཡང་དག་པར་བཞག་པ་དང་སེམས་ཀྱི་རྟོག་པ་འདི་ལྟ་བུ་སྐྱེས་སོ། །
en: “Staying in a dwelling at the edge of the āśram , the boy remained in solitude and practiced meditation.

source: གསང་ཚིག་ཅེས་བྱ་བ་འདི་གང་ཡིན།
en: ‘What,’ he thought, ‘is a “spell”?

source: ཅི་གང་རླུང་གི་དཀྱིལ་འཁོར་ཡིན་ནམ།
en: Is it like the wind?

source: འདི་ལྟར་རླུང་གི་དཀྱིལ་འཁོར་ནི་གནས་མེད་ཅིང་གཞི་མེད་ལ་གནས་པ་མ་ཡིན་ཏེ།
en: The wind has no support or basis—it is not supported by anything.

source: འདི་ལྟར་རླུང་གི་དཀྱིལ་འཁོར་གྱིས་བསླང་བ་དེ་ནི་ཤར་ཕྱོགས་སུ་གདགས་པ་མེད་ཅིང་། ལྷོ་ཕྱོགས་སུ་མེད། རྒྱ་ཆེར་སྦྱར་ཏེ་ཕྱོགས་བཅུ་ནས་སྟེང་གི་ཕྱོགས་ཀྱི་བར་དུ་གདགས་པ་མེད་དེ།
en: When the wind stirs it is free from concepts in the east, the south, or in any other of the ten directions.

source: ཞི་བ་མི་དམིགས། འདུལ་བ་མི་དམིགས། བཏུལ་བ་མི་དམིགས་སོ། །
en: There is no apprehension of peace, taming, or pacification.

source: སེམས་ཅན་མེད་པའི་ཕྱིར་རོ་སྙམ་མོ། །
en: Because it does not exist as a sentient being.’

source: དེ་དེ་ལྟར་ཚུལ་བཞིན་གྱིས་སོ་སོར་རྟོག་པ་ནི་འདི་སྙམ་དུ་སེམས།
en: “Discerning correctly in this way, he concluded,

source: བྲམ་ཟེའི་ཁྱེའུ་མཁན་པོ་དང་བཅས་པ་འདི་དག་ཐམས་ཅད་ནི་ལམ་གོལ་བ་ལ་གནས་པ་ཡིན་ཏེ། འདི་ལས་ཉོན་མོངས་པ་འབྱུང་ངོ་སྙམ་མོ། །
en: ‘All the brahmin boys and their teachers are on the wrong path, a path that brings affliction.’

source: དེའི་ཚེ་གནས་གཙང་མའི་ལྷ་དག་ལུས་ཀྱིས་མངོན་སུམ་དུ་བར་སྣང་ལ་འདུག་ནས།
en: “At that point some gods of the pure abodes made their bodies perceptible in the sky before him.

source: དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: They said, ‘Well thought!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་བསླབས་ཤིང་། ལམ་ཁོང་དུ་ཆུད་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: Noble son you have followed all the thus-gone ones and comprehended their path. Well done!

source: རིགས་ཀྱི་བུ་ལམ་འདིས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཕྲ་མོའི་རྡུལ་སྙེད་པས་ཀྱང་མང་བའི་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Noble son, thus-gone ones more numerous than the subtle particles contained within inexpressibly many buddha realms have awoken to unsurpassed and perfect buddhahood by following this path.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་གི་དོན་མཛད་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: In this way they have benefitted countless beings and passed beyond suffering.’

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། བྲམ་ཟེའི་ཁྱེའུ་བདུན་སྟོང་པོ་མཁན་པོ་དང་བཅས་པ་དེ་དག་ལ་གཏམ་དེ་སྨྲས་སོ། །
en: “When he arose from his absorption, the boy spoke to the seven thousand brahmin boys and their teachers and,

source: སེམས་ཅན་དེ་དག་གིས་ཐོས་ནས་ བླ་ན་
en: upon hearing his words, all those beings became irreversible from unsurpassed and perfect awakening.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིང་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: Having become thus-gone ones who awoke to unsurpassed and perfect buddhahood,

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་གི་བློ་གྲོས་དེས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་འབྱུང་བ་དག་བཞུགས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དག་གི་ཆོས་རྣམ་པ་གསུམ་ཡོངས་སུ་བཟུང་ངོ་། །
en: In this way the bodhisattva Supreme Intelligence accomplished the triple qualities of the thus-gone ones’ appearing, remaining, and passing beyond suffering.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་གི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the sage Supreme Intelligence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་གི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Supreme Intelligence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སེམས་ཅན་ངོ་བོ་ཉིད་མེད་པར་ངེས་པར་རིག་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to awaken to unsurpassed and perfect buddhahood must ascertain that sentient beings have no essential nature.”

source: མཽད་གལ་གྱི་བུ་ངས་མ་རིག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་ཞེས་བྱ་བ་ནས། བདག་གིས་ཇི་ལྟར་མངོན་པར་འདུ་བྱ་སྙམ་པའི་བར་སྔ་མ་བཞིན་དུ་སྦྱར་རོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand ignorance. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of ignorance.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དྲང་སྲོང་རིག་བྱེད་ཤེས་པ་ཞེས་བྱ་བ་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a sage named Knower of the Vedas.

source: རིག་བྱེད་ཐམས་ཅད་ཤེས་པ། བསྟན་བཅོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ།
en: The sage had knowledge of all the Vedas and he was a master of all the treatises.

source: དོན་ཐམས་ཅད་རིག་པ། རྫུ་འཕྲུལ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ་ལ་མཐུ་ཆེ་བ། ཕྱི་རོལ་གྱི་ལམ་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཞིག་བྱུང་སྟེ
en: Possessing knowledge of all issues, he had great miraculous powers and splendor, and had attained freedom from attachment to pleasures by means of the outer path.

source: དེའི་ཚེའི་ཚད་ལོ་སྟོང་ཕྲག་དགུ་བཅུར་གྱུར་ཏོ། །
en: “At that time the lifespan of people was ninety thousand years.

source: དེས་ལོ་སྟོང་ཕྲག་བརྒྱད་ཅུར་ནམས་ཀྱང་གློས་མ་ཕབ་ཅིང་། ནམས་ཀྱང་རྨུགས་པ་དང་གཉིད་མ་ལོག་སྟེ།
en: Once, when the sage had lived eighty thousand years he sat up, feeling sad and unable to sleep.

source: གཞན་དུ་ན་སྡུག་བསྔལ་འདི་ག་ལས་བྱུང་ཞེས་དེ་ལྟར་སེམས་ཀྱིས་སེམས་སོ། །
en: He wondered, ‘From where does suffering come?

source: མི་ཤེས་པའི་དབང་ལས་གཞན་མ་ཡིན་ཏེ།
en: Suffering is due to nothing but ignorance.

source: མི་ཤེས་པ་ནི་འཁོར་བའི་རྒྱུན་ཆགས་པར་འགྱུར་ལ།
en: Ignorance sustains the continuity of cyclic existence.

source: ཤེས་ཤིང་མཐོང་བ་ནི་འཁོར་བ་ལྡོག་པར་འགྱུར་རོ་སྙམ་མོ། །
en: Through knowledge and perception cyclic existence can be reversed.’
